Оперативные_задачи_Занятие_4/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРезерве</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>InformationRegister.ПланированиеОказаниеУслуг</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваровПоПартиям</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Менеджеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Оперативные_задачи_Занятие_4/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОтветственныйЗаЗакупки</name>
    <type>
      <types>CatalogRef.Менеджеры</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Оперативные_задачи_Занятие_4/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Оперативные_задачи_Занятие_4/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Менеджеры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Оперативные_задачи_Занятие_4/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Оперативные_задачи_Занятие_4/src/AccumulationRegisters/ТоварыВРезерве/ТоварыВРезерве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВРезерве</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Оперативные_задачи_Занятие_4/src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ДополнительныеСвойства.Свойство("РасчетСебестоимости") = Ложь Тогда
		
		#Область ОперативноеПроведение
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровИУслугТовары.Номенклатура,
		|	РеализацияТоваровИУслугТовары.Количество
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
		|ГДЕ
		|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
		|	И РеализацияТоваровИУслугТовары.Номенклатура.Услуга = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = Выборка.Количество;
			
			Движение = Движения.СвободныеОстатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = Выборка.Количество;
			
			
		КонецЦикла;
		
		//Будем анализировать увеличение позиций в документе при перепроведении
		//только в оперативном режиме
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		
			МВТ = Новый МенеджерВременныхТаблиц;
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МВТ;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СвободныеОстатки.Номенклатура КАК Номенклатура,
			|	СвободныеОстатки.Количество КАК Количество
			|ПОМЕСТИТЬ ВТПередЗаписью
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
			|ГДЕ
			|	СвободныеОстатки.Регистратор = &Регистратор";
			
			Запрос.УстановитьПараметр("Регистратор", Ссылка);
			
			Запрос.Выполнить();
			
		
		КонецЕсли;

		
		Движения.СвободныеОстатки.Записывать = Истина;
		Движения.СвободныеОстатки.БлокироватьДляИзменения = Истина;
		Движения.Записать();
		
		//В зависимости от режима проведения выполняем разный запрос
		//В оперативном режиме считаем остатки только у увеличенных позиций
		//в неоперативном режиме считаем остатки по всем позициям
		
		Запрос = Новый Запрос;
		
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
			
			
			Запрос.МенеджерВременныхТаблиц = МВТ;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СвободныеОстатки.Номенклатура КАК Номенклатура,
			|	СвободныеОстатки.Количество КАК Количество
			|ПОМЕСТИТЬ ВТОбъединение
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
			|ГДЕ
			|	СвободныеОстатки.Регистратор = &Регистратор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТПередЗаписью.Номенклатура,
			|	-1 * ВТПередЗаписью.Количество
			|ИЗ
			|	ВТПередЗаписью КАК ВТПередЗаписью
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТОбъединение.Номенклатура КАК Номенклатура,
			|	СУММА(ВТОбъединение.Количество) КАК Количество
			|ПОМЕСТИТЬ ВТСписок
			|ИЗ
			|	ВТОбъединение КАК ВТОбъединение
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТОбъединение.Номенклатура
			|
			|ИМЕЮЩИЕ
			|	СУММА(ВТОбъединение.Количество) > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
			|	СвободныеОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки.Остатки(
			|			&Период,
			|			Склад = &Склад
			|				И Номенклатура В
			|					(ВЫБРАТЬ
			|						ВТСписок.Номенклатура КАК Номенклатура
			|					ИЗ
			|						ВТСписок КАК ВТСписок)) КАК СвободныеОстаткиОстатки
			|ГДЕ
			|	СвободныеОстаткиОстатки.КоличествоОстаток < 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТПередЗаписью";
			
			
			
			
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СвободныеОстатки.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВТСписок
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
			|ГДЕ
			|	СвободныеОстатки.Регистратор = &Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
			|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки.Остатки(
			|			&Период,
			|			Склад = &Склад
			|				И Номенклатура В
			|					(ВЫБРАТЬ
			|						ВТСписок.Номенклатура КАК Номенклатура
			|					ИЗ
			|						ВТСписок КАК ВТСписок)) КАК ОстаткиТоваровОстатки
			|ГДЕ
			|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
			
			
		КонецЕсли;
		
		Период = ?(Режим = РежимПроведенияДокумента.Оперативный
		, Неопределено
		, Новый Граница( МоментВремени()   , ВидГраницы.Включая) );
		
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		Запрос.УстановитьПараметр("Склад", Склад);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
			
			//Менеджер временных таблиц нам нужен только в оперативном режиме
			МВТ.Закрыть();
		
		КонецЕсли;
		
		
		Если  РезультатЗапроса.Пустой() = Ложь  Тогда
			
			Отказ = Истина;
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщить("Нет " + ВыборкаДетальныеЗаписи.Номенклатура
				+ ". Нехватка " + ВыборкаДетальныеЗаписи.КоличествоОстаток);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Отказ = Истина Тогда
			
			Сообщить("Не проведен документ " + Ссылка);
			Возврат;
			
		КонецЕсли;
		
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Контрагент = Контрагент;
			Движение.Склад = Склад;
			Движение.Менеджер = Менеджер;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.Себестоимость = 0;
			
		КонецЦикла;
		
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Сумма = Товары.Итог("Сумма");
		
		Движения.Взаиморасчеты.Записывать = Истина;
		Движения.ОстаткиТоваров.Записывать = Истина;
		Движения.Продажи.Записывать = Истина;
		Движения.ТоварыВРезерве.Записывать = Истина;
		
		#Область ПланированиеОказанияУслуг
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТовары.Номенклатура,
		|	РеализацияТовары.Сумма,
		|	РеализацияТовары.Количество
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|	И РеализацияТовары.Номенклатура.Услуга = ИСТИНА";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Движение = Движения.ПланированиеОказаниеУслуг.Добавить();
			
			Движение.Период = Дата;
			Движение.Услуга = Выборка.Номенклатура;
			Движение.Контрагент = Контрагент;
			Движение.ДокументОснование = Ссылка;
			
		КонецЦикла;
		
		Движения.ПланированиеОказаниеУслуг.Записывать = Истина;
		
		#КонецОбласти
		
		#КонецОбласти
		
		
	Иначе
		
		#Область РасчетСебестоимости
		//Сегодня работем в этой области!!
		Сообщить("Расчет себестоимости по документу " + Ссылка);
		
		
		#КонецОбласти

	КонецЕсли;

КонецПроцедуры

Процедура ЗарезервироватьТовары() Экспорт
	
	Отказ = Ложь;    //Это объявление переменной
	
	НачатьТранзакцию();
	
	Записать(РежимЗаписиДокумента.Запись);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровИУслугТовары.Номенклатура,
	|	РеализацияТоваровИУслугТовары.Количество
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
	|ГДЕ
	|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
	|	И РеализацияТоваровИУслугТовары.Номенклатура.Услуга = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ТоварыВРезерве.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		
		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		
	КонецЦикла;
	
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвободныеОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстатки.Количество КАК Количество
	|ПОМЕСТИТЬ ВТПередЗаписью
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
	|ГДЕ
	|	СвободныеОстатки.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Запрос.Выполнить();
	
	
	Движения.СвободныеОстатки.Записывать = Истина;
	Движения.СвободныеОстатки.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвободныеОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстатки.Количество КАК Количество
	|ПОМЕСТИТЬ ВТОбъединение
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
	|ГДЕ
	|	СвободныеОстатки.Регистратор = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТПередЗаписью.Номенклатура,
	|	-1 * ВТПередЗаписью.Количество
	|ИЗ
	|	ВТПередЗаписью КАК ВТПередЗаписью
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОбъединение.Номенклатура КАК Номенклатура,
	|	СУММА(ВТОбъединение.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТСписок
	|ИЗ
	|	ВТОбъединение КАК ВТОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОбъединение.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТОбъединение.Количество) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки.Остатки(
	|			&Период,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТСписок.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТСписок КАК ВТСписок)) КАК СвободныеОстаткиОстатки
	|ГДЕ
	|	СвободныеОстаткиОстатки.КоличествоОстаток < 0";
	
	
	Период = Неопределено; //Механизм резервирования не "исторический". Резервируем реальные остатки.
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МВТ.Закрыть();
	
	
	Если  РезультатЗапроса.Пустой() = Ложь  Тогда
		
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Сообщить("Для установки резерва нет " + ВыборкаДетальныеЗаписи.Номенклатура
			+ ". Нехватка " + ВыборкаДетальныеЗаписи.КоличествоОстаток);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ = Истина Тогда
		
		ОтменитьТранзакцию();
		Возврат;
		
	Иначе
		
		Движения.ТоварыВРезерве.Записать();
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
КонецПроцедуры
